# 1. В диапазоне натуральных чисел от 2 до 99 определить, сколько из них кратны любому из чисел в диапазоне от 2 до 9



'''

# Сначала я поняла условие так

array = [_ for _ in range (2,100)]

for n in range (2,10):
    even_n = 0                 # Количество кратных чисел
    for i in range(len(array)):
         if array[i] % n == 0:
             even_n+=1
    print(f'Количество чисел, кратных {n} = {even_n}')'''

# Но в телеграмме вы сказали что нужно вывести сколько чисел кратны двум, трем  и т д  числам

array = [_ for _ in range (2,100)]


even_2 = even_3 = even_4 = even_5 = even_6 = even_7 = even_8 = even_9 = 0
for i in range (len (array)):
    n = 0                 # Количество кратных чисел
    for j in range(2,10):
         if array[i] % j == 0:
             n+=1
    if n == 2:
       even_2 += 1
    if n == 3 :
       even_3 += 1
    if n == 4 :
       even_4 += 1
    if n == 5 :
       even_5 += 1
    if n == 6 :
       even_6 += 1
    if n == 7:
       even_7 += 1
    if n == 8:
       even_8 += 1
    if n == 9:
       even_9 += 1

print(f'Количество чисел, кратных 2 числам - { even_2}')
print(f'Количество чисел, кратных 3 числам - { even_3}')
print(f'Количество чисел, кратных 4 числам - { even_4}')
print(f'Количество чисел, кратных 5 числам - { even_5}')
print(f'Количество чисел, кратных 6 числам - { even_6}')
print(f'Количество чисел, кратных 7 числам - { even_7}')
print(f'Количество чисел, кратных 8 числам - { even_8}')
print(f'Количество чисел, кратных 9 числам - { even_9}')
